#+TITLE: Godog

* Go Dog (on evolving file)
#+begin_src shell :prologue "(\n" :epilogue "\n) 2>&1\n:\n"
~/go/bin/godog --format junit:results.xml example.feature
#+end_src

#+RESULTS:
#+begin_example
2021/06/17 19:18:17 Adding BeforeSuite Func()
2021/06/17 19:18:17 Adding AfterSuite Func()
2021/06/17 19:18:17 Running BeforeSuite()
2021/06/17 19:18:17 We are BeforeScenario : "example.feature" : "given, when, and then" : "7"
2021/06/17 19:18:17 Settings Godogs = 0
2021/06/17 19:18:17 We are BeforeStep : "4" : "a starting point"
2021/06/17 19:18:17 We configured a starting point!!
2021/06/17 19:18:17 We are AfterStep : "4" : "a starting point"
2021/06/17 19:18:17 We are BeforeStep : "5" : "a change is made"
2021/06/17 19:18:17 A Change was Made!!
2021/06/17 19:18:17 We are AfterStep : "5" : "a change is made"
2021/06/17 19:18:17 We are BeforeStep : "6" : "we see results"
2021/06/17 19:18:17 We canhaz results!!
2021/06/17 19:18:17 We are AfterStep : "6" : "we see results"
2021/06/17 19:18:17 We are AfterScenario : "example.feature" : "given, when, and then" : "7"
2021/06/17 19:18:17 Running AfterSuite()
#+end_example
* Go test
Running go test instead!
#+begin_src shell :prologue "(\n" :epilogue "\n) 2>&1\n:\n"
go test --godog.format junit:results.xml
#+end_src

#+RESULTS:
#+begin_example
2021/06/17 19:19:03 TestMain is being called with Testing.M
2021/06/17 19:19:03 Adding BeforeSuite Func()
2021/06/17 19:19:03 Adding AfterSuite Func()
2021/06/17 19:19:03 Running BeforeSuite()
2021/06/17 19:19:03 We are BeforeScenario : "features/example.feature" : "given, when, and then" : "7"
2021/06/17 19:19:03 Settings Godogs = 0
2021/06/17 19:19:03 We are BeforeStep : "4" : "a starting point"
2021/06/17 19:19:03 We configured a starting point!!
2021/06/17 19:19:03 We are AfterStep : "4" : "a starting point"
2021/06/17 19:19:03 We are BeforeStep : "5" : "a change is made"
2021/06/17 19:19:03 A Change was Made!!
2021/06/17 19:19:03 We are AfterStep : "5" : "a change is made"
2021/06/17 19:19:03 We are BeforeStep : "6" : "we see results"
2021/06/17 19:19:03 We canhaz results!!
2021/06/17 19:19:03 We are AfterStep : "6" : "we see results"
2021/06/17 19:19:03 We are AfterScenario : "features/example.feature" : "given, when, and then" : "7"
2021/06/17 19:19:03 Running AfterSuite()
testing: warning: no tests to run
PASS
ok  	github.com/zachmandeville/tester-prototype/org	0.410s
#+end_example

